questions = [
    {"text": "Что представляет собой класс set в Python?", "options": ["Упорядоченную коллекцию повторяющихся элементов.", "Неупорядоченную коллекцию уникальных элементов.", "Коллекцию, которая может содержать только числовые значения.", "Структуру данных, которая поддерживает только строки.", "Упорядоченную коллекцию уникальных элементов."]},
    {"text": "Какими двумя способами можно создать объект set в Python?", "options": ["С помощью фигурных скобок {}", "Используя квадратные скобки []", "С помощью функции set()", "С помощью круглых скобок ()", "Создавая пустой словарь {}"]},
    {"text": "Как можно добавить один элемент в множество в Python?", "options": ["Используя метод add()", "Используя метод append()", "Присваивая значение по индексу", "Используя метод insert()", "С помощью операции +"]},
    {"text": "Как можно добавить сразу несколько элементов в множество в Python?", "options": ["Используя метод add()", "Используя метод extend()", "Используя метод update()", "Присваивая значения по индексу", "Используя метод insert()"]},

]